In [2]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
from scipy import stats


import warnings
warnings.filterwarnings("ignore")

In [3]:
path = r"C:\Users\user\Desktop\adult.csv"

In [4]:
df=pd.read_csv(path)

In [5]:
df.head()

,age,workclass,fnlwgt,education,educational-num,...,capital-gain,capital-loss,hours-per-week,native-country,income
0,25,Private,226802,11th,7,...,0,0,40,United-States,<=50K
1,38,Private,89814,HS-grad,9,...,0,0,50,United-States,<=50K
2,28,Local-gov,336951,Assoc-acdm,12,...,0,0,40,United-States,>50K
3,44,Private,160323,Some-college,10,...,7688,0,40,United-States,>50K
4,18,?,103497,Some-college,10,...,0,0,30,United-States,<=50K

In [6]:
df.isnull().sum()

age                0
workclass          0
fnlwgt             0
education          0
educational-num    0
marital-status     0
occupation         0
relationship       0
race               0
gender             0
capital-gain       0
capital-loss       0
hours-per-week     0
native-country     0
income             0
dtype: int64

In [7]:
df.isin(['?']).sum()

age                   0
workclass          2799
fnlwgt                0
education             0
educational-num       0
marital-status        0
occupation         2809
relationship          0
race                  0
gender                0
capital-gain          0
capital-loss          0
hours-per-week        0
native-country      857
income                0
dtype: int64

In [8]:
df["workclass"]=df["workclass"].replace("?", df["workclass"].mode()[0])

df["occupation"]=df["occupation"].replace("?", df["occupation"].mode()[0])

df["native-country"]=df["native-country"].replace("?", df["native-country"].mode()[0])

In [9]:
df.isin(['?']).sum()

age                0
workclass          0
fnlwgt             0
education          0
educational-num    0
marital-status     0
occupation         0
relationship       0
race               0
gender             0
capital-gain       0
capital-loss       0
hours-per-week     0
native-country     0
income             0
dtype: int64

In [10]:
df=df.drop(columns=["fnlwgt","educational-num","capital-gain",'capital-loss'])

In [11]:
df["income"] = df.income.map({'<=50K': 0, '>50K': 1, '<=50K.': 0, '>50K.': 1})

df["income2"] = df["income"].map({0 : "<=50k", 1 : ">=50k"})

In [12]:
df["marriage-status"]=df["marital-status"].map({'Never-married':'Single', "Widowed" : "Single", "Divorced":"Single", "Separated":"Single",'Married-civ-spouse':"Married",'Married-spouse-absent':"Married", 'Married-AF-spouse':"Married"  })